Repository: EternalTimes/wslcontainerdesktop
Catalog: src/WslContainerDesktop/Strings/*/Resources.resw
Source language: en_us
Languages: zh_hans

# Resource_Registries_007.Text
source: USERNAME
zh_hans: 用户名

# Resource_Registries_008.Text
source: STATUS
zh_hans: 状态

# Resource_Registries_009.Text
source: ACTIONS
zh_hans: 操作

# Resource_Registries_010.Text
source: default
zh_hans: 默认

source: Log in
zh_hans: 登录

# Resource_Registries_011.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Log in / re-authenticate
zh_hans: 登录 / 重新认证

# Resource_Registries_012.Text
source: Log in
zh_hans: 登录

source: Log out
zh_hans: 退出登录

# Resource_Registries_013.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Log out
zh_hans: 退出登录

# Resource_Registries_014.Text
source: Log out
zh_hans: 退出登录

# Resource_Registries_015.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Remove
zh_hans: 删除

# Resource_Registries_016.Text
source: default
zh_hans: 默认

# Resource_Registries_017.Text
source: HOST
zh_hans: 主机

# Resource_Registries_018.Text
source: USERNAME
zh_hans: 用户名

# Resource_Registries_019.Text
source: STATUS
zh_hans: 状态

# Resource_Registries_020.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Log in / re-authenticate
zh_hans: 登录 / 重新认证

# Resource_Registries_021.Text
source: Log in
zh_hans: 登录

# Resource_Registries_022.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Log out
zh_hans: 退出登录

# Resource_Registries_023.Text
source: Log out
zh_hans: 退出登录

# Resource_Registries_024.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Remove
zh_hans: 删除

# Resource_Registries_Extra1.Title
source: Registry policy
zh_hans: 镜像仓库策略

# Resource_Text_00a302fb4bec
source: Couldn't check for updates (private registry or network error).
zh_hans: 无法检查更新（私有镜像仓库或网络错误）。

# Resource_Text_01d84a089f65
source: {0} is still attached to a container, so it can't be removed.
zh_hans: {0} 仍与容器连接，因此无法删除。

# Resource_Text_01e8e3e9272d
source: The selected path is not a regular file.
zh_hans: 所选路径不是普通文件。

# Resource_Text_043660976a99
source: Create image from exported files
zh_hans: 从导出的文件创建镜像

# Resource_Text_054e0e987ae5
source: Pushed all tags for {0}
zh_hans: 已推送 {0} 的所有标签

# Resource_Text_06cf19039cfe
source: ⚠ Some of these are mounted by other containers and would lose data too.
zh_hans: ⚠ 部分卷已被其他容器挂载，其数据也会丢失。

# Resource_Text_075341e9d7a5
source: Remove all unused volumes?
zh_hans: 删除所有未使用的数据卷？

# Resource_Text_0a4444676244
source: Save failed
zh_hans: 保存失败

# Resource_Text_0a6181aadd01
source: New tag
zh_hans: 新标签

# Resource_Text_0a855f042e1d
source: Remove all stopped containers?
zh_hans: 删除所有已停止的容器？

# Resource_Text_0b4cce3f68bc
source: Could not list this directory.
zh_hans: 无法列出此目录。

# Resource_Text_0cac0038a833
source: File was not found after copy.
zh_hans: 复制后未找到文件。

# Resource_Text_0d553567c19c
source: Stop and remove the container that uses it first, then try again.
zh_hans: 请先停止并删除使用此卷的容器，然后重试。

# Resource_Text_0e7629279488
source: image
zh_hans: 镜像

# Resource_Text_0ef1f1bf6b99
source: Push failed
zh_hans: 推送失败

# Resource_Text_0f620c7a4975
source: Download by path…
zh_hans: 按路径下载…

# Resource_Text_10f421d7769d
source: Creating container from {0}…
zh_hans: 正在从 {0} 创建容器…

# Resource_Text_124ff13ed4b4
source: Download by path
zh_hans: 按路径下载

# Resource_Text_13ebc1f3d6b6
source: Remove network
zh_hans: 删除网络

# Resource_Text_146781e43eff
source: Upload incomplete
zh_hans: 上传未完成

# Resource_Text_148f26a65911
source: Unknown or partial usage is not proof that a volume is unused.
zh_hans: 未知或不完整的使用情况不能证明数据卷未被使用。

# Resource_Text_15404127f80d
source: Remove container
zh_hans: 删除容器

# Resource_Text_15ffeb6bd8fd
source: Logout of {0} failed.
zh_hans: 退出 {0} 的登录失败。

# Resource_Text_175cc793d8cd
source: Comparing the container against its image…
zh_hans: 正在比较容器与镜像…

# Resource_Text_178b6d858ce7
source: Unknown or partial usage is not proof that a volume is unused. The engine determines removal eligibility.
zh_hans: 未知或不完整的使用情况不能证明数据卷未被使用。是否可删除由引擎决定。

# Resource_Text_18ff715ccce4
source: Remove containers
zh_hans: 删除容器

# Resource_Text_19f49d852660
source: images
zh_hans: 个镜像

# Resource_Text_1afff0157ce3
source: Attach
zh_hans: 连接

# Resource_Text_1bc58937f376
source: Copying {0} into {1}…
zh_hans: 正在将 {0} 复制到 {1}…

# Resource_Text_1c2351331a73
source: Create volume
zh_hans: 创建数据卷

# Resource_Text_1d10323c27ec
source: Standalone
zh_hans: 独立容器

# Resource_Text_1d6a489471ee
source: Build diagnosis preview
zh_hans: 生成诊断预览

# Resource_Text_1dc601643c46
source: Load failed
zh_hans: 加载失败

# Resource_Text_1e057f25f7a8
source: All images are up to date.
zh_hans: 所有镜像均为最新版本。

# Resource_Text_20c7c5522fc2
source: Ready
zh_hans: 就绪

# Resource_Text_2129bd311ebc
source: Pulling {0}… (this can take a while)
zh_hans: 正在拉取 {0}…（可能需要较长时间）

# Resource_Text_215d03e9ca3f
source: A registry with host "{0}" already exists.
zh_hans: 已存在主机为“{0}”的镜像仓库。

# Resource_Text_2177fed070db
source: Creating folder {0}…
zh_hans: 正在创建文件夹 {0}…

# Resource_Text_21c4293e05f3
source: Building {0}…
zh_hans: 正在构建 {0}…

# Resource_Text_2250bc0a0fff
source: Collecting and redacting evidence…
zh_hans: 正在收集证据并脱敏…

# Resource_Text_2561aa510ea7
source: Health check: unhealthy
zh_hans: 健康检查：异常

# Resource_Text_259af9c750d4
source: Starting {0} container(s)…
zh_hans: 正在启动 {0} 个容器…

# Resource_Text_25cef6554cad
source: Upload files…
zh_hans: 上传文件…

# Resource_Text_2683787a3644
source: Already added
zh_hans: 已添加

# Resource_Text_26bcd52e50cf
source: Delete {0} "{1}" from {2}? This cannot be undone.
zh_hans: 从 {2} 删除{0}“{1}”？此操作无法撤销。

# Resource_Text_2817459eb07e
source: Checking for updates…
zh_hans: 正在检查更新…

# Resource_Text_281eabe4676a
source: Note: volume usage could not be fully determined, so this list may be incomplete.
zh_hans: 注意：无法完全确定数据卷的使用情况，因此此列表可能不完整。

# Resource_Text_28ae52107c73
source: Pushing {0}… (this can take a while)
zh_hans: 正在推送 {0}…（可能需要较长时间）

# Resource_Text_291562a2b23c
source: Delete from container
zh_hans: 从容器中删除

# Resource_Text_295ea1ef065b
source: Attached to {0}
zh_hans: 已连接到 {0}

# Resource_Text_2a23b36f66db
source: Streaming logs for {0}
zh_hans: 正在持续读取 {0} 的日志

# Resource_Text_2bc3f06a3680
source: Opened {0}
zh_hans: 已打开 {0}

# Resource_Text_2c030e0770e8
source: Loading images…
zh_hans: 正在加载镜像…

# Resource_Text_2c3cafa4db3f
source: File
zh_hans: 文件

# Resource_Text_2c7e82a6c879
source: {0} of {1} could not be removed (they may still be attached to a container): {2}
zh_hans: {1} 项中有 {0} 项无法删除（可能仍与容器连接）： {2}

# Resource_Text_2d357820e622
source: Pulled all tags for {0}
zh_hans: 已拉取 {0} 的所有标签

# Resource_Text_2f1332b9df3c
source: {0} of {1} could not be removed (they may still have attached containers): {2}
zh_hans: {1} 项中有 {0} 项无法删除（可能仍有连接的容器）： {2}

# Resource_Text_2f1b853115c5
source: Up to date with the registry.
zh_hans: 已与镜像仓库同步至最新版本。

# Resource_Text_2f24ebaee0aa
source: Prune
zh_hans: 清理

# Resource_Text_2f8e461f4b9f
source: Build failed
zh_hans: 构建失败

# Resource_Text_2fde889dcf36
source: Exporting {0} filesystem…
zh_hans: 正在导出 {0} 的文件系统…

# Resource_Text_30baa24967e0
source: Folder
zh_hans: 文件夹

# Resource_Text_3121cab8f91c
source: Delete these volumes
zh_hans: 删除这些数据卷

# Resource_Text_31e11fbaef14
source: Remove all unused networks?
zh_hans: 删除所有未使用的网络？

# Resource_Text_32663265855e
source: Connecting {0} to {1}…
zh_hans: 正在将 {0} 连接到 {1}…

# Resource_Text_3411657c13ba
source: Refreshing Azure sign-in for {0}…
zh_hans: 正在刷新 {0} 的 Azure 登录…

# Resource_Text_361423979de2
source: Logs · {0}
zh_hans: 日志 · {0}

# Resource_Text_364d6567206c
source: Stopping {0}…
zh_hans: 正在停止 {0}…

# Resource_Text_36d578179e3d
source: The selected path is not a directory.
zh_hans: 所选路径不是目录。

# Resource_Text_377a4368adbd
source: Running {0}…
zh_hans: 正在运行 {0}…

# Resource_Text_385fef159470
source: Preview is limited to files up to {0} KiB.
zh_hans: 预览仅支持不超过 {0} KiB 的文件。

# Resource_Text_389e0c4950f6
source: e.g. my-data
zh_hans: 例如 my-data

# Resource_Text_399694e59ed3
source: {0} File
zh_hans: {0} 文件

# Resource_Text_3a167b296e0d
source: {0} of {1} operations failed: {2}
zh_hans: {1} 项操作中有 {0} 项失败： {2}

# Resource_Text_3aab4f9f1a96
source: Creating image from exported files…
zh_hans: 正在从导出的文件创建镜像…

# Resource_Text_3ad374153994
source: e.g. myrepo/myimage:v1
zh_hans: 例如 myrepo/myimage:v1

# Resource_Text_3c60d06bc185
source: Push complete
zh_hans: 推送完成

# Resource_Text_3c784acc314d
source: {0} months ago
zh_hans: {0} 个月前

# Resource_Text_400c9fca3752
source: Published ports are still unknown for {0} running container(s); the list may be incomplete.
zh_hans: 有 {0} 个运行中容器的已发布端口仍未知，列表可能不完整。

# Resource_Text_4133934aa616
source: Prune failed
zh_hans: 清理失败

# Resource_Text_41904cc8b86a
source: {0} minutes ago
zh_hans: {0} 分钟前

# Resource_Text_41f05a5f626f
source: Exported {0} to {1}. To make an image from it, use Images → Import → Create image from exported files….
zh_hans: 已将 {0} 导出到 {1}。要用其创建镜像，请选择镜像 → 导入 → 从导出的文件创建镜像…。

# Resource_Text_44fa701be401
source: Could not open this file.
zh_hans: 无法打开此文件。

# Resource_Text_456d7bf9ed42
source: Checking for image updates…
zh_hans: 正在检查镜像更新…

# Resource_Text_47e73c701cb3
source: Name for the new image (optional; without one it is listed as <none>)
zh_hans: 新镜像名称（可选；未指定时显示为 <none>）

# Resource_Text_4805b7e0585a
source: Container started
zh_hans: 容器已启动

# Resource_Text_4d11e46048eb
source: Disconnect "{0}" from its only network "{1}"? The container will have no network attachments.
zh_hans: 将“{0}”从唯一的网络“{1}”断开？容器将没有网络连接。

# Resource_Text_4dc0b033c68a
source: Removing {0} image(s)…
zh_hans: 正在删除 {0} 个镜像…

# Resource_Text_4ea61ec0985e
source: Health check configured for {0}
zh_hans: 已为 {0} 配置健康检查

# Resource_Text_4f0c763a9779
source: {0} of {1} failed
zh_hans: {1} 项中有 {0} 项失败

# Resource_Text_4fabdcfbb3cd
source: Confidence: {0:P0}
zh_hans: 置信度：{0:P0}

# Resource_Text_517cef447ed8
source: Tar archive
zh_hans: Tar 归档

# Resource_Text_526dc383e386
source: Full path of a file or folder inside the container
zh_hans: 容器内文件或文件夹的完整路径

# Resource_Text_52c47ecd72ac
source: Pushing all tags for {0}… (this can take a while)
zh_hans: 正在推送 {0} 的所有标签…（可能需要较长时间）

# Resource_Text_53802e672d6d
source: Not logged in
zh_hans: 未登录

# Resource_Text_558c85c42670
source: Stopping {0} container(s)…
zh_hans: 正在停止 {0} 个容器…

# Resource_Text_5641e0c6613e
source: Remove "{0}" ({1})? This also logs out of it.
zh_hans: 删除“{0}”（{1}）？这也会退出其登录。

# Resource_Text_56e3badc4e6c
source: Refresh
zh_hans: 刷新

# Resource_Text_587588037564
source: Failed to load volumes
zh_hans: 加载数据卷失败

# Resource_Text_58d3b07833b2
source: Prune images
zh_hans: 清理镜像

# Resource_Text_592c06f9dff1
source: This container isn't running, so its files can't be listed. You can still upload files.
zh_hans: 容器未运行，无法列出其文件，但仍可上传文件。

# Resource_Text_5b44479e9557
source: {0} … and {1} more
zh_hans: {0} …另有 {1} 项

# Resource_Text_5c477ce5a8d3
source: Pulled {0}
zh_hans: 已拉取 {0}

# Resource_Text_5dfeef082bb5
source: {0} year ago
zh_hans: {0} 年前

# Resource_Text_5e34cda5a434
source: Removed {0}.
zh_hans: 已删除 {0}。

# Resource_Text_5e8760f506fb
source: No saved profiles
zh_hans: 没有保存的配置

# Resource_Text_5e90eeae3d81
source: Removing {0} container(s)…
zh_hans: 正在删除 {0} 个容器…

# Resource_Text_5f94b03c2e6a
source: Remove image
zh_hans: 删除镜像

# Resource_Text_5fd2e5751c47
source: (others unknown)
zh_hans: （其他使用者未知）

# Resource_Text_606d1a1317c3
source: Some volumes were kept
zh_hans: 已保留部分数据卷

# Resource_Text_606fbf1cfca3
source: Open the Changes tab to compare the container against its image.
zh_hans: 打开更改选项卡以比较容器与镜像。

# Resource_Text_60c1e625e1e8
source: Log file
zh_hans: 日志文件

# Resource_Text_6577b0e94cf2
source: Creating {0}…
zh_hans: 正在创建 {0}…

# Resource_Text_658d1f8b6e57
source: Prune containers
zh_hans: 清理容器

# Resource_Text_666f53f2d084
source: The wslc help does not document a detach key sequence; pressing Ctrl+C may stop the container's main process.
zh_hans: wslc 帮助未说明断开连接的按键组合；按 Ctrl+C 可能停止容器的主进程。

# Resource_Text_6674b1cfe7e6
source: Removed {0} image(s)
zh_hans: 已删除 {0} 个镜像

# Resource_Text_680e9fe1f01f
source: Remove networks
zh_hans: 删除网络

# Resource_Text_68d7791c0474
source: Pushed {0}
zh_hans: 已推送 {0}

# Resource_Text_68d903613f94
source: Failed to load images
zh_hans: 加载镜像失败

# Resource_Text_69047d7b411a
source: Can't remove volume
zh_hans: 无法删除数据卷

# Resource_Text_694a9eea485e
source: Upload to container
zh_hans: 上传到容器

# Resource_Text_6b11865fce3e
source: Prune networks
zh_hans: 清理网络

# Resource_Text_6bbef811d085
source: Pushed {0}.
zh_hans: 已推送 {0}。

# Resource_Text_6caa7c7f6403
source: Health check removed for {0}
zh_hans: 已为 {0} 移除健康检查

# Resource_Text_6d490981d8f3
source: Couldn't create the image
zh_hans: 无法创建镜像

# Resource_Text_6d6cc85f99eb
source: {0} month ago
zh_hans: {0} 个月前

# Resource_Text_6ea189897ddb
source: Saved images restored
zh_hans: 已恢复保存的镜像

# Resource_Text_713907849045
source: Send diagnosis
zh_hans: 发送诊断

# Resource_Text_73989d9c5926
source: Running
zh_hans: 运行中

# Resource_Text_73b3566a1003
source: e.g. my-snapshot:latest
zh_hans: 例如 my-snapshot:latest

# Resource_Text_7505d64a54e0
source: default
zh_hans: 默认

# Resource_Text_75d39bfaedaf
source: Logged in
zh_hans: 已登录

# Resource_Text_75e2d31e3fc3
source: Opening {0}…
zh_hans: 正在打开 {0}…

# Resource_Text_770d22e09b5d
source: Attach opens an interactive terminal connected to the container's main process.
zh_hans: 连接操作会打开与容器主进程相连的交互式终端。

# Resource_Text_7800478a75f7
source: Some images were not removed
zh_hans: 部分镜像未删除

# Resource_Text_7a0320794cdb
source: {0} day ago
zh_hans: {0} 天前

# Resource_Text_7c7a8c1ac2c8
source: Couldn't restore images
zh_hans: 无法恢复镜像

# Resource_Text_7de825040e20
source: Deleting {0}…
zh_hans: 正在删除 {0}…

# Resource_Text_7e216826243b
source: Some volumes were not removed
zh_hans: 部分数据卷未删除

# Resource_Text_7e892fbf5dd3
source: If you are unsure, keep them — you can delete volumes later from the Volumes page.
zh_hans: 如不确定，请保留数据卷，之后可在数据卷页面删除。

# Resource_Text_7f2f6a15cf8d
source: Error
zh_hans: 错误

# Resource_Text_7f43dc519669
source: Kept (still used by other containers):
zh_hans: 保留（仍被其他容器使用）：

# Resource_Text_7fa7f416b8c2
source: Remove volume
zh_hans: 删除数据卷

# Resource_Text_800c9b197e97
source: (no output)
zh_hans: （无输出）

# Resource_Text_815f075b8069
source: This volume
zh_hans: 此数据卷

# Resource_Text_820d6004b037
source: Checking…
zh_hans: 检查中…

# Resource_Text_851ccf3326fb
source: Copied path: {0}
zh_hans: 已复制路径：{0}

# Resource_Text_85af00327c89
source: Logged in to {0}.
zh_hans: 已登录 {0}。

# Resource_Text_895d5f585893
source: Remove {0} volume(s)? Data in these volumes will be lost. {1}
zh_hans: 删除 {0} 个数据卷？这些数据卷中的数据将丢失。 {1}

# Resource_Text_8a0295266057
source: Preview ready
zh_hans: 预览已就绪

# Resource_Text_8bce8c2e43e4
source: To download a folder, right-click → Download to…
zh_hans: 要下载文件夹，请右键点击 → 下载到…

# Resource_Text_8c3c6433325f
source: Removing "{0}" leaves this storage behind. Its data would be permanently deleted:
zh_hans: 删除“{0}”会留下以下存储，其数据将被永久删除：

# Resource_Text_8d1bde4c53c0
source: Pulling all tags of {0}… (this can take a while)
zh_hans: 正在拉取 {0} 的所有标签…（可能需要较长时间）

# Resource_Text_8e3e84404b4c
source: Health check: healthy
zh_hans: 健康检查：健康

# Resource_Text_8ee0e62563d4
source: Pull failed
zh_hans: 拉取失败

# Resource_Text_8f329751da39
source: Pulling {0}…
zh_hans: 正在拉取 {0}…

# Resource_Text_913e469a6bb6
source: No published ports. Start a container that publishes a port to see it here.
zh_hans: 没有已发布端口。启动发布端口的容器后将在此显示。

# Resource_Text_92bffa1208b8
source: Remove image "{0}" ({1})?
zh_hans: 删除镜像“{0}”（{1}）？

# Resource_Text_9344533c4118
source: {0} days ago
zh_hans: {0} 天前

# Resource_Text_93c23d7b9d3d
source: Couldn't inspect {0}: {1}
zh_hans: 无法检查 {0}：{1}

# Resource_Text_95562ee52bdb
source: Tag image
zh_hans: 给镜像添加标签

# Resource_Text_9665af7c3b74
source: Volume name
zh_hans: 数据卷名称

# Resource_Text_971c419dd609
source: file
zh_hans: 文件

# Resource_Text_97e7c38762f2
source: Remove volumes
zh_hans: 删除数据卷

# Resource_Text_9804556fd4b8
source: Copy path
zh_hans: 复制路径

# Resource_Text_9838561fcd74
source: Copied suggested fix to the clipboard.
zh_hans: 已将建议的修复方案复制到剪贴板。

# Resource_Text_9865aa8a5117
source: Your organization restricts WSL container image registries to:
zh_hans: 组织允许使用的 WSL 容器镜像仓库：

# Resource_Text_9869e506c38f
source: Expand
zh_hans: 展开

# Resource_Text_986f9ecd3fff
source: . Existing engine health is unchanged; native health changes require explicit container recreation.
zh_hans: 。现有引擎健康检查未更改；要更改原生健康检查，必须明确重新创建容器。

# Resource_Text_99ce9af38e30
source: Not in use
zh_hans: 未使用

# Resource_Text_9a3274443563
source: {0} years ago
zh_hans: {0} 年前

# Resource_Text_9a365d432483
source: Logged out of {0}.
zh_hans: 已退出 {0} 的登录。

# Resource_Text_9a731f3d6dec
source: Run failed
zh_hans: 运行失败

# Resource_Text_9ac3790ec276
source: Sending diagnosis
zh_hans: 正在发送诊断

# Resource_Text_9be9953c1125
source: {0} change(s) relative to the image.
zh_hans: 相对镜像有 {0} 项更改。

# Resource_Text_9bed5104004c
source: Anonymous
zh_hans: 匿名

# Resource_Text_9cd3f346fe82
source: Remove volume "{0}"? Data in the volume will be lost.
zh_hans: 删除数据卷“{0}”？数据卷中的数据将丢失。

# Resource_Text_9cf188d3a677
source: Collapse
zh_hans: 折叠

# Resource_Text_9d2c38b4b694
source: Disconnecting {0} from {1}…
zh_hans: 正在将 {0} 从 {1} 断开…

# Resource_Text_9e1ba089f927
source: Build complete
zh_hans: 构建完成

# Resource_Text_9e627c7b1aec
source: New name
zh_hans: 新名称

# Resource_Text_a0ffbf99439d
source: Starting {0}…
zh_hans: 正在启动 {0}…

# Resource_Text_a1270477a181
source: Logging out of {0}…
zh_hans: 正在退出 {0} 的登录…

# Resource_Text_a28caef66f74
source: You can retry from the Volumes page.
zh_hans: 可在数据卷页面重试。

# Resource_Text_a31fed794752
source: Unused (inspect snapshot)
zh_hans: 未使用（检查快照）

# Resource_Text_a357d651d722
source: Copying from {0}...
zh_hans: 正在从 {0} 复制…

# Resource_Text_a5d663720ca0
source: Remove registry
zh_hans: 删除镜像仓库

# Resource_Text_a6418012e17d
source: {0} Inspect users include stopped containers. Estimated users are based on creation time only.
zh_hans: {0} 检查得到的使用者包含已停止的容器。估算使用者仅依据创建时间推断。

# Resource_Text_a711999b72aa
source: New folder
zh_hans: 新建文件夹

# Resource_Text_a7652bb6962c
source: The container was removed, but these volumes could not be deleted: {0}.
zh_hans: 容器已删除，但无法删除以下数据卷：{0}。

# Resource_Text_a7f8e7cc0d43
source: just now
zh_hans: 刚刚

# Resource_Text_aa284d0c56a2
source: Unreachable
zh_hans: 无法访问

# Resource_Text_aa7b49519d41
source: Health check: down after {0} restart attempt(s)
zh_hans: 健康检查：尝试重启 {0} 次后仍不可用

# Resource_Text_ac10bc95d7dc
source: - usage incomplete; unknown does not mean unused
zh_hans: - 使用情况不完整；未知不代表未使用

# Resource_Text_ad507942e77c
source: The container must be running to compare it against its image.
zh_hans: 容器必须运行才能与镜像进行比较。

# Resource_Text_ad9df8088c63
source: Copying {0} to the host…
zh_hans: 正在将 {0} 复制到主机…

# Resource_Text_aea8cc2d34a5
source: Remove images
zh_hans: 删除镜像

# Resource_Text_afffdd08d81d
source: folder
zh_hans: 文件夹

# Resource_Text_b0b05c5ac5a9
source: Endpoint inventory is unavailable because the engine inventory could not be read.
zh_hans: 无法读取引擎清单，因此端点清单不可用。

# Resource_Text_b1a7b2ac9b99
source: Health check: down
zh_hans: 健康检查：不可用

# Resource_Text_b2ce023b4255
source: Folder name
zh_hans: 文件夹名称

# Resource_Text_b41211bd2b39
source: File not yet staged for drag — select it and try again.
zh_hans: 文件尚未准备好拖动，请选中后重试。

# Resource_Text_b412ef531663
source: Loading volumes…
zh_hans: 正在加载数据卷…

# Resource_Text_b52ef0d49360
source: Update status unknown.
zh_hans: 更新状态未知。

# Resource_Text_b5d06eb9a6ed
source: Tag failed
zh_hans: 添加标签失败

# Resource_Text_b89fa9b868b3
source: Remove container "{0}" ({1})? This cannot be undone.
zh_hans: 删除容器“{0}”（{1}）？此操作无法撤销。

# Resource_Text_b993b0c53719
source: No results
zh_hans: 无结果

# Resource_Text_b9f7af9f92c3
source: Couldn't tag the image as {0}. {1}
zh_hans: 无法将镜像标记为 {0}。 {1}

# Resource_Text_ba9007f2e1ff
source: Killing {0}…
zh_hans: 正在强制停止 {0}…

# Resource_Text_baf8b3e388d5
source: Build an image from a Dockerfile
zh_hans: 从 Dockerfile 构建镜像

# Resource_Text_bbc90b86ba92
source: A newer version of this tag is available from its registry. Click Update to pull it; containers already running from the old version keep using it until you recreate them.
zh_hans: 镜像仓库中有此标签的新版本。点击更新以拉取；已使用旧版本运行的容器会继续使用旧版本，直到重新创建。

# Resource_Text_bbd27860bdd0
source: Updated {0}
zh_hans: 已更新 {0}

# Resource_Text_bc7819b34ff8
source: Unknown
zh_hans: 未知

# Resource_Text_bdd2820865ec
source: Your organization's WSLContainerRegistryAllowlist policy is invalid; registry operations fail closed until it is corrected.
zh_hans: 组织的 WSLContainerRegistryAllowlist 策略无效，在修复之前将禁用镜像仓库操作。

# Resource_Text_be5db383a1cb
source: Build blocked by policy
zh_hans: 策略禁止构建

# Resource_Text_bef915666604
source: Saved run profile "{0}" from {1}
zh_hans: 已从 {1} 保存运行配置“{0}”

# Resource_Text_bf081353c9b0
source: Uploading {0} item(s) to {1}…
zh_hans: 正在上传 {0} 项到 {1}…

# Resource_Text_bf877971d0a8
source: Suggested fixes are review-only.
zh_hans: 建议的修复方案仅供审阅。

# Resource_Text_c00f6627f603
source: Login failed
zh_hans: 登录失败

# Resource_Text_c05fe6c2ab87
source: … (unnamed)
zh_hans: …（未命名）

# Resource_Text_c090d6cb9136
source: {0} Includes stopped containers, which rejoin this network when they start.
zh_hans: {0} 包含已停止的容器，这些容器启动时将重新加入此网络。

# Resource_Text_c0f95512437f
source: Some containers failed
zh_hans: 部分容器操作失败

# Resource_Text_c128d9da3bc5
source: Health check disabled for {0}
zh_hans: 已为 {0} 禁用健康检查

# Resource_Text_c2370bb291a5
source: Remove all dangling (unused) images?
zh_hans: 删除所有悬空（未使用）的镜像？

# Resource_Text_c4e6ed956953
source: Operation failed
zh_hans: 操作失败

# Resource_Text_c673cfe7a7a2
source: Restoring saved images…
zh_hans: 正在恢复已保存的镜像…

# Resource_Text_c68e758ba4ac
source: Restarting {0}…
zh_hans: 正在重启 {0}…

# Resource_Text_c97652eb6016
source: File edits:
zh_hans: 文件修改：

# Resource_Text_ca3ab35903c6
source: {0} of {1} could not be removed (they may be in use by a container): {2}
zh_hans: {1} 项中有 {0} 项无法删除（可能正在被容器使用）： {2}

# Resource_Text_ca4eff772dac
source: Volume refresh cancelled or timed out; displayed data may be stale
zh_hans: 数据卷刷新已取消或超时，显示的数据可能已过期

# Resource_Text_cb5d30ca0eaa
source: Prune volumes
zh_hans: 清理数据卷

# Resource_Text_cc4941571be3
source: GPU passthrough enabled
zh_hans: 已启用 GPU 直通

# Resource_Text_cc4eac830ba9
source: {0} hour ago
zh_hans: {0} 小时前

# Resource_Text_cd105da7078d
source: Remove {0} network(s)? (Built-in networks are skipped.) {1}
zh_hans: 删除 {0} 个网络？（跳过内置网络。） {1}

# Resource_Text_cd3422258efb
source: Download to…
zh_hans: 下载到…

# Resource_Text_cee33896303a
source: {0} hours ago
zh_hans: {0} 小时前

# Resource_Text_cf9b77061f7b
source: Open
zh_hans: 打开

# Resource_Text_d068c4665803
source: Every published port across your running containers, in one place.
zh_hans: 集中显示所有运行中容器的已发布端口。

# Resource_Text_d17c7bc1ab98
source: Removing {0}…
zh_hans: 正在删除 {0}…

# Resource_Text_d2078b7339a5
source: Save as run profile
zh_hans: 保存为运行配置

# Resource_Text_d2313d7e8a46
source: Logout failed
zh_hans: 退出登录失败

# Resource_Text_d241b398580b
source: Loading networks…
zh_hans: 正在加载网络…

# Resource_Text_d2865cc8490e
source: Commands:
zh_hans: 命令：

# Resource_Text_d361a643faee
source: Health check: unhealthy — auto-restarting ({0}/{1})
zh_hans: 健康检查：异常，正在自动重启（{0}/{1}）

# Resource_Text_d3be85b2d66b
source: Logged in to {0} using Azure.
zh_hans: 已使用 Azure 登录 {0}。

# Resource_Text_d3f4cb898fbe
source: Rename
zh_hans: 重命名

# Resource_Text_d443bd63ddee
source: Pushed all tags for {0}.
zh_hans: 已推送 {0} 的所有标签。

# Resource_Text_d45ea5bcae67
source: Renaming {0}…
zh_hans: 正在重命名 {0}…

# Resource_Text_d5e904efdf15
source: Loading {0}…
zh_hans: 正在加载 {0}…

# Resource_Text_d73c0bb0fa10
source: Also delete this container's volumes?
zh_hans: 是否同时删除此容器的数据卷？

# Resource_Text_d863ee4cc811
source: Open the Files tab to browse the container filesystem.
zh_hans: 打开文件选项卡以浏览容器文件系统。
